Tekla.Structures.ModelInternal.ScopedCDelegateSetter
Can be used for scoped settings of ICDelegate.

Tekla.Structures.ModelInternal.ScopedCDelegateSetter.#ctor(Tekla.Structures.ModelInternal.ICDelegate)
Construct scoped setter and set the DelegateProxy.Delegate to what is provided for constructor.
deleg:

Tekla.Structures.ModelInternal.ScopedCDelegateSetter.Dispose
Restores the DelegateProxy.Delegate to what it was before this class was constructed.